app/views/dynamic_pages/gossip.html.erb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%id = params[:id]%>
<%gossip = Gossip.find(id)%>