app/views/dynamic_pages/user.html.erb

<%id = params[:id]%>
<%user = User.find(id.to_i)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]