app/views/dynamic_pages/welcome.html.erb

<ul>
	<%Gossip.all.each do |i|%>
---
SELECT "gossips".* FROM "gossips"

  <div class="card-body">
    <p class="card-text"><a href="gossip/<%=i.id%>"><li><%=i.user.first_name%> :<br><%=i.title%></li></a></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]